; ====================================================================================================
; asm07.asm
; sound test program
; ====================================================================================================
SECTION code_user
PUBLIC _main

_main:
; ====================================================================================================
; 初期処理
; ====================================================================================================
	CALL GICINI		                ; GICINI	PSGの初期化

    ; PSGレジスタ番号
    ; 0,1   : チャンネルA周波数(8bit+4bit)
    ; 2,3   : チャンネルB周波数(8bit+4bit)
    ; 4,5   : チャンネルC周波数(8bit+4bit)
    ; 6     : ノイズ周波数(5bit)
    ; 7     : チャンネル設定(8bit)
    ; 8     : チャンネルA音量(5bit)
    ; 9     : チャンネルB音量(5bit)
    ; 10    : チャンネルC音量(5bit)
    ; 11,12 : エンベロープ周期(8bit+8bit)
    ; 13    : エンベロープ形状(4bit)

    ; ■ここから音を出す設定
	LD A,7			                ; PSGレジスタ番号=7(チャンネル設定)
	LD E,%10111000	                ; 各チャンネルのON/OFF設定 0:ON 1:OFF,10+NOISE C～A+TONE C～A
	CALL WRTPSG		                ; BIOS WRTPSG  PSGレジスタへデータを書き込み

    ; ■ここから音程を設定
    LD A,0                          ; PSGレジスタ番号=0(チャンネルA周波数 上位8ビット)
    LD E,254
    CALL WRTPSG
    LD A,1                          ; PSGレジスタ番号=1(チャンネルA周波数 下位4ビット)
    LD E,0
    CALL WRTPSG

    ; ■ここから音量を設定
    LD A,8                          ; PSGレジスタ番号=8(チャンネルA音量)
    LD E,15                         ; 0～15の音量 or 16(エンベロープモード)を指定
    CALL WRTPSG


MAINLOOP:
	; ■垂直帰線待ち
	HALT

	JR MAINLOOP

; ====================================================================================================
; 定数エリア
; romに格納される
; ====================================================================================================
SECTION rodata_user

GICINI:	                EQU $0090	; PSGの初期化 ｱﾄﾞﾚｽ
WRTPSG:	                EQU $0093   ; PSGﾚｼﾞｽﾀへのﾃﾞｰﾀ書込 ｱﾄﾞﾚｽ

